### Lesson 8

#### --> Combining Datasets: Concat  
#### --> Using Merge  
    --> Inner  
    --> Outer  
    --> Left Merge  
    --> Right Merge  

#### --> Joins  
    --> Inner Join  
    --> Outer Join  
    --> Left Join  
    --> Right Join

### Combining Datasets: Concat

In [2]:
import pandas as pd
import numpy as np

In [4]:
data_1 = pd.Series([1,2,3,4,5], index = list('abcde'))
data_2 = pd.Series([2,4,6,8,10], index = list('fghij'))

In [5]:
pd.concat([data_1,data_2])

a     1
b     2
c     3
d     4
e     5
f     2
g     4
h     6
i     8
j    10
dtype: int64

In [6]:
data_1 = pd.Series([1,2,3,4,5], index = list('abcde'))
data_2 = pd.Series([2,4,6,8,10], index = list('bghij'))

In [8]:
pd.concat([data_1,data_2])

     0     1
a  1.0   NaN
b  2.0   2.0
c  3.0   NaN
d  4.0   NaN
e  5.0   NaN
g  NaN   4.0
h  NaN   6.0
i  NaN   8.0
j  NaN  10.0

In [16]:
series_1 = pd.Series([1,2,3,4,5], index=list('abcde'))
series_2 = pd.Series([7,8,9,10,11], index = list('ghijk'))

In [25]:
data_value_1 = pd.DataFrame({'A':series_1})
data_value_2 = pd.DataFrame({'B':series_2})

In [26]:
data_value_1

   A
a  1
b  2
c  3
d  4
e  5

In [27]:
data_value_2

    B
g   7
h   8
i   9
j  10
k  11

In [28]:
pd.concat([data_value_1,data_value_2])

     A     B
a  1.0   NaN
b  2.0   NaN
c  3.0   NaN
d  4.0   NaN
e  5.0   NaN
g  NaN   7.0
h  NaN   8.0
i  NaN   9.0
j  NaN  10.0
k  NaN  11.0

In [52]:
data_values_1 = pd.DataFrame([['A','B'],['C','D']],index = [0,1], columns = list('AB'))
data_values_2 = pd.DataFrame([['E','F'],['G','H']],index = [0,1], columns = list('CD'))

In [53]:
data_values_1

   A  B
0  A  B
1  C  D

In [48]:
data_values_2

   C  D
0  E  F
1  G  H

In [56]:
print(data_values_1)
print('\n')
print(data_values_2)
print('\n')
print(pd.concat([data_values_1,data_values_2]))

   A  B
0  A  B
1  C  D


   C  D
0  E  F
1  G  H


     A    B    C    D
0    A    B  NaN  NaN
1    C    D  NaN  NaN
0  NaN  NaN    E    F
1  NaN  NaN    G    H

In [57]:
print(data_values_1)
print('\n')
print(data_values_2)
print('\n')
pd.concat([data_values_1,data_values_2],axis='columns')

   A  B
0  A  B
1  C  D


   C  D
0  E  F
1  G  H

   A  B  C  D
0  A  B  E  F
1  C  D  G  H

In [64]:
x = pd.DataFrame([[0,0],[1,1]], columns = list(['A','B']))
y = pd.DataFrame([[2,3],[2,3]], columns = list(['C','D']))

print(x)
print('\n')
print(y)

   A  B
0  0  0
1  1  1


   C  D
0  2  3
1  2  3

In [67]:
y.columns = x.columns

In [68]:
pd.concat([x,y],axis='columns')

   A  B  A  B
0  0  0  2  3
1  1  1  2  3

In [69]:
pd.concat([x,y],axis='rows')

   A  B
0  0  0
1  1  1
0  2  3
1  2  3

### Using Merge

In [70]:
Players= ['Player1','Player2','Player3']
Points = [8,4,9]
Game = ['Game1','Game3','Game4']

df1 = pd.DataFrame({'Player':Players,'Points':Points,'Game':Game})
df1

    Player  Points   Game
0  Player1       8  Game1
1  Player2       4  Game3
2  Player3       9  Game4

In [71]:
Players= ['Player1','Player5','Player3']
Premium_User = ['Yes','Yes','No']


df2 = pd.DataFrame({'Player':Players,'Premium User':Premium_User})
df2

    Player Premium User
0  Player1          Yes
1  Player5          Yes
2  Player3           No

### Inner

In [74]:
df1.merge(df2,on='Player', how='inner')

    Player  Points   Game Premium User
0  Player1       8  Game1          Yes
1  Player3       9  Game4           No

### Outer

In [76]:
df1.merge(df2, on='Player', how='outer')

    Player  Points   Game Premium User
0  Player1     8.0  Game1          Yes
1  Player2     4.0  Game3          NaN
2  Player3     9.0  Game4           No
3  Player5     NaN    NaN          Yes

### Left Merge

In [78]:
df1.merge(df2,on='Player', how='left')

    Player  Points   Game Premium User
0  Player1       8  Game1          Yes
1  Player2       4  Game3          NaN
2  Player3       9  Game4           No

### Right Merge

In [80]:
df1.merge(df2, on='Player', how='right')

    Player  Points   Game Premium User
0  Player1     8.0  Game1          Yes
1  Player5     NaN    NaN          Yes
2  Player3     9.0  Game4           No

### Joins

In [90]:
Players= ['Player1','Player2','Player3']
Points = [8,4,9]
Game = ['Game1','Game3','Game4']

df1 = pd.DataFrame({'Player':Players,'Points':Points,'Game':Game}, index = ['P1','P2','P3'])
df1

     Player  Points   Game
P1  Player1       8  Game1
P2  Player2       4  Game3
P3  Player3       9  Game4

In [93]:
player = ['Player1','Player5','Player3']
Premium_User = ['Yes','Yes','No']


df2 = pd.DataFrame({'Players':player ,'Premium User':Premium_User}, index = ['P1','P3','P7'])
df2

    Players Premium User
P1  Player1          Yes
P3  Player5          Yes
P7  Player3           No

### Inner Join

In [94]:
df1.join(df2, how='inner')

     Player  Points   Game  Players Premium User
P1  Player1       8  Game1  Player1          Yes
P3  Player3       9  Game4  Player5          Yes

### Outer Join

In [95]:
df1.join(df2, how='outer')

     Player  Points   Game  Players Premium User
P1  Player1     8.0  Game1  Player1          Yes
P2  Player2     4.0  Game3      NaN          NaN
P3  Player3     9.0  Game4  Player5          Yes
P7      NaN     NaN    NaN  Player3           No

### Left Join

In [96]:
df1.join(df2, how='left')

     Player  Points   Game  Players Premium User
P1  Player1       8  Game1  Player1          Yes
P2  Player2       4  Game3      NaN          NaN
P3  Player3       9  Game4  Player5          Yes

### Right Join

In [97]:
df1.join(df2, how='right')

     Player  Points   Game  Players Premium User
P1  Player1     8.0  Game1  Player1          Yes
P3  Player3     9.0  Game4  Player5          Yes
P7      NaN     NaN    NaN  Player3           No